{
  "reference": {
    "installation": "Please try to include details in your submissions for approval.",
    "links": ["https://github.com/Blade2021/HIVE-RefData","https://hivedev.roots.systems"],
    "description": "Wanna help develop a database of helpful information for beginners starting out in the home automation field?  Help us grow the HIVE Reference Database by submitting commits/PRs to the link included.",
    "category": ["utilities"]
  },
  "tasmota": {
    "alias": ["tasmoto"],
    "installation": "To learn more about flashing tasmota onto your supported device, check out this article: https://tasmota.github.io/docs/Getting-Started/",
    "links": ["https://tasmota.github.io/docs/","https://tasmota.github.io/docs/Getting-Started/","https://templates.blakadder.com/"],
    "description": "Tasmota is a firmware that can be flashed onto ESP8266-based products created by Theo Arends.  It was originally used for Sonoff boards, but quickly snowballed to include all ESP8266 chips.  You can use it to control just about everything that you want (plugs, switches, dimmers, bulbs, et cetera).\n\nThe reason you'd load this firmware onto your devices is to keep your smart item traffic local to your premise, and not sending it to the cloud servers.  (So that when the internet goes out, the smartness of your things doesn't also).\n\nTasmota is 100% free and open source making it a great product for the home automation community.\n\nThe community submits configuration templates for devices to a site maintained by a user named Blakadder, so most things are pretty easy to configure.  If you run across a new product without a template, you will need to work out where things like LEDs, relays, and the like are by adjusting template settings manually -- but once you've got it, you can submit it to the repository!.\n\nBlakadder's team also maintains a 'naughty list' of devices that are not compatible.",
    "category": ["switching-applications"]
  },
  "nodered": {
    "installation": "To learn how to install node-red check out this link: https://nodered.org/docs/getting-started/local",
    "links": ["https://bit.ly/2XkGZMi","https://nodered.org/docs/getting-started/local","http://www.steves-internet-guide.com/node-red-overview/","http://www.steves-internet-guide.com/node-red-message-object/"],
    "description": "Node-Red is a fantastic flow based visual tool for creating and linking automations and devices.  Node-Red works very well with Home-Assistant to provide a nice easy infrastructure for your wildest dreams.",
    "category": ["infrastructure","super awesome gadget of the future!"]
  },
  "refTest": {
    "alias": [],
    "installation": "How does one install it?  A how to, a link to a article.",
    "links": ["https://google.com"],
    "description": "A simple description of what 'IT' is",
    "category": ["switching-applications"]
  },
  "ESP8266": {
    "alias":["ESP-8266","ESP8285","AI-Thinker","ESP-01","NodeMCU","Wemos","D1","Huzzah"],
    "installation": "It should be known that some ESP chips do not come with soldered pins, So soldering may be required.",
    "links": ["https://www.espressif.com/en/products/socs/esp8266/overview","https://en.wikipedia.org/wiki/ESP8266"],
    "description": "The ESP8266 is a microcontroller with built-in 2.4GHz Wifi (802.11b/g/n) made by a company called Espressif.  It comes in several flavors, each one with its own part number, but most people refer them collectively as 'ESP8266'.\n\nIt was originally designed and released as a wifi bridge to be used in conjunction with other microcontrollers and was initially released with only 8 pins exposed on a module known as an ESP-01.  It is super cheap, and when everyone realized that it was much more capable than being just a wifi bridge, people started using it in projects and products.  Espressif heard about what was being done with their chips and started releasing different modules with all of the pins exposed.\n\nThere aren't very many pins, though, and some of them are a bit... quirky to use.  But, because they're cheap, many smart home gadget companies started using them as the main chip in their products.  (Sonoff, Shelly, and Tuya being three you'll see thrown around in here.)\n\nGenerally, we only recommend the bare chips for advanced users who are designing their own circuit boards.  If you are looking to include one in your project, there are many options for pre-built development boards that have everything you'll need for a successful integration.\n\nNodeMCU Boards https://tinyurl.com/yal4c3a4\nWemos D1 Mini https://tinyurl.com/yalstq77",
    "category": ["microcontroller"]
  },
  "Zigbee": {
    "alias":["deconz","conbee-2","conbee"],
    "installation": "Zigbee devices require a hub to communicate so be sure to have one ready!",
    "links": ["https://www.amazon.com/dresden-elektronik-ConBee-Universal-Gateway/dp/B07PZ7ZHG5/","https://www.aliexpress.com/item/32865555473.html?","https://www.youtube.com/watch?v=bVa6Yw1gCP0"],
    "description": "Zigbee is a communication protocol that has flourished in the home automation community.  Zigbee is often preferred to Wifi-based technologies due to its low power consumption and long battery life.  The downside to using zigbee is you need to have a HUB to communicate with all of your devices.  In some ways this is advantageous as it requires fewer devices connect to your wifi network.\n\nOne zigbee hub that has a high approval is the conbee 2.  It is not the cheapest option, but it is fairly easy to configure and always performs very well with devices.  Another great option is the Zigbee2MQTT hub which will relay zigbee data to your mqtt broker.  Whichever hub you select, be sure to verify that devices are supported by your hub before buying as most hubs do not support every device.\n\nIf nothing else, Zigbee is a very powerful protocol that opens the horizon to many types of sensors, switches, and other types of home automation devices.\n\n**CAUTION** Zigbee operates in the 2.4 GHz Spectrum, which is shared with Wifi, Bluetooth, Microwave Ovens, and some cordless telephones.  If you have a lot of 2.4 GHz present at your location, your Zigbee devices may be unreliable.",
    "category": ["infrastructure", "bridge", "utilities"]
  }
   "ESP32": {
    "alias":["ESP-32","WROVER","WROOM"],
    "installation": "It should be known that some ESP chips do not come with soldered pins, So soldering may be required.",
    "links": ["https://www.espressif.com/en/products/socs/esp32/overview","https://en.wikipedia.org/wiki/ESP32"],
    "description": "The ESP32 is a microcontroller with built-in 2.4GHz Wifi (802.11b/g/n) and Bluetooth (Classic and BLE) made by a company called Espressif.  It comes in several flavors, each one with its own part number, but most people refer them collectively as 'ESP32'.\n\nIt was created as a successor to the wildly popular ESP8266, and has many more pins and available on-board functions, such as Bluetooth, Capacitive Touch, Analog Pins (both ADC and DAC), PWM, I2C, I2S, SPI, and many others.  While they are more expensive than the ESP8266-based chips and boards, the ESP32 is still a good value for any projects requiring many inputs or outputs, bluetooth connectivity, or sensor integration.\n\nGenerally, we only recommend the bare chips for advanced users who are designing their own circuit boards.  If you are looking to include one in your project, there are many options for pre-built development boards that have everything you'll need for a successful integration.\n\n",
    "category": ["microcontroller"]
  },
  
}
